app/controllers/stores_controller.rb

SELECT "stores".* FROM "stores" WHERE "stores"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17')
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'name'
	ordering,@name_header = {:name => :asc}, 'bg-warning hilite'
    when 'description'
	ordering,@description_header = {:description => :asc}, 'bg-warning hilite'
    end
    @all_ratings = Store.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
	@selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", 1]]
---
  def search_for_same_rating
    @store = Store.find(params[:id])