app/controllers/stores_controller.rb

  def show
    id = params[:id]
    @cur_item = ""
    @store = Store.find(id)
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", 7]]

  def index
    if params[:search] != "" and !params[:search].nil? #if non-empty search entry
      @stores = Store.search_stores(params[:search])
      @selected_categories = {}
      @all_categories = Store.all_categories
      if @stores.blank?
---
SELECT "stores".* FROM "stores" WHERE (lower(name) LIKE '%hmart%' OR lower(category) LIKE '%hmart%' OR lower(description) LIKE '%hmart%' OR lower(menu) LIKE '%hmart%')

      redirect_to :sort => sort, :categories => @selected_categories and return
    end

    @stores = Store.where(category: @selected_categories.keys).order(ordering)
---
SELECT "stores".* FROM "stores" WHERE "stores"."category" IN ('Cafe', 'Chinese', 'Drinks', 'Groceries', 'Italian')

  def create
    new_params = {}

    new_params[:name] = params[:name]

    new_params[:store_id] = Store.find_by(name: new_params[:name]).id

    new_params[:deliver_to] = order_params[:deliver_to]

    new_params[:item] = order_params[:item]

    new_params[:user_id] = current_user.id

    new_params[:status] = 'pending'
    @order = Order.create!(new_params)
---
INSERT INTO "orders" ("name", "deliver_to", "item", "user_id", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Famiglias"], ["deliver_to", "asdfasdf"], ["item", "Cheese Pizza"], ["user_id", "1"], ["status", "pending"]]

  def my_orders
      id = current_user.id
      if params[:id] != 'id'
        Order.find(params[:id]).update_attributes(:status => "done" % current_user.username)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", "1"]]

  def orders
      if params[:id] != 'id'
          Order.find(params[:id]).update_attributes(:status => "delivering" % current_user.username)
      end
      @orders = Order.all
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "orders" SET "status" = ? WHERE "orders"."id" = ?  [["status", "evan delivering"], ["id", 14]]
SELECT "orders".* FROM "orders"

  def edit
    @store = Store.find params[:id]
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", 3]]

  def update
    @store = Store.find params[:id]
    @store.update_attributes!(store_params)
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "stores" SET "rating" = ? WHERE "stores"."id" = ?  [["rating", "G"], ["id", 3]]