app/controllers/stores_controller.rb

DELETE FROM "orders" WHERE "orders"."id" = 1
---
  def orders
      id = params[:id]
      @orders = Order.all
      if params[:id] != 'id'
          @orders.delete(Order.find params[:id])